Autodesk.Revit.DB.Visual.AssetProperties.IsValidIndex(System.Int32)
Returns true if the provided index is valid.
index:
Index to be validated.
Returns:
True if index is valid, false otherwise.
Since:
2019

Autodesk.Revit.DB.Visual.AssetProperties.Get(System.Int32)
Gets the property at the given index.
index:
An integer index.
Returns:
The property at the given index.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is out of range.
Since:
2019

Autodesk.Revit.DB.Visual.AssetProperties.FindByName(System.String)
Gets the property with the given name.
Remarks:
FindByName will not visit the properties of any connected asset on any of the properties.
name:
Name of the property.
Returns:
The property with the specified name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetProperties.Size
The number of the AssetProperty(s) in the object.

Autodesk.Revit.DB.Visual.AssetProperties.default(System.Int32)
Gets the one property that the current object contains with the given index.

Autodesk.Revit.DB.Visual.AssetProperties.default(System.String)
Gets the one property that the current object contains with the given name.

Autodesk.Revit.DB.Visual.AssetProperties
Represents a set of asset property(s).